## Q1. 가상머신이란 무엇인가?
A1. 물리적인 하드웨어 컴퓨터 환경을 소프트웨어로 구현한 논리적 컴퓨터이며, 하이퍼바이저 소프트웨어를 이용해 실제 컴퓨터의 CPU, 메모리, 디스크 등의 자원을 분할하여, 한 대의 물리적 기기 위에서 독립된 여러 개의 OS를 동시에 구동할 수 있게 해준다.

## Q2. 가상머신을 사용하는 이유를 설명하라.
A2. 윈도우 환경에서 리눅스 환경을 사용할 수 있음. 격리된 환경에서 작동되어 다른 os 에 영향을 주지않음.

## Q3. WSL2가 다른 가상머신 소프트웨어와 비교하여 장점이 무엇인가?
A3. 성능이 좋으며 부팅 시간이 빠름. 윈도우와 리눅스간의 파일이동이 자유로움.

## Q4. GUI, CLI의 장단점을 비교 설명하시오.
A4. gui 의 경우 손쉽게 사용할 수 있음. 다만 자원 소비가 큼. cli 의 경우 자원을 적게 사용하며 반복작업이 용이함. 다만 명령어를 알아야 사용할 수 있음.

## Q5. CLI방식의 인터페이스가 GUI방식보다 처리속도가 빠른 이유를 설명하라.
A5. 텍스트로만 처리되어 gui 보다 자원 소비가 적음. 명령어가 바로 커널로 전달됨.

## Q6. 리눅스에서는 왜 CLI방식을 주로 사용하는가?
A6. 네트워크 대역폭을 적게 사용해 서버용으로 쓰기 효과적임.

## Q7. 리눅스 명령어란 무엇이고 중요 5개 명령어를 조사하라. 실행결과를 첨부하라.
A7. pwd : 절대경로, ls : 디렉터리 목록, mkdir : 디렉터리 생성, cat : 파일 내용 출력, top : cpu, 메모리 사용량 모니터링.
